---
type: XYZ
namespace: Autodesk.Revit.DB
version: 2024
members: 28
tags: [revit-api, class]
---

# XYZ

`Autodesk.Revit.DB.XYZ` · Revit 2024 · 28 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | XYZ | — | `` |
| Constructor | XYZ | — | `public XYZ ()` |
| Method | Add | — | `public XYZ Add ( XYZ source )` |
| Method | AngleOnPlaneTo | — | `public double AngleOnPlaneTo ( XYZ right , XYZ normal )` |
| Method | AngleTo | — | `public double AngleTo ( XYZ source )` |
| Method | CrossProduct | — | `public XYZ CrossProduct ( XYZ source )` |
| Method | DistanceTo | — | `public double DistanceTo ( XYZ source )` |
| Method | Divide | — | `public XYZ Divide ( double value )` |
| Method | DotProduct | — | `public double DotProduct ( XYZ source )` |
| Method | GetLength | — | `public double GetLength ()` |
| Method | IsAlmostEqualTo | — | `` |
| Method | IsUnitLength | — | `public bool IsUnitLength ()` |
| Method | IsWithinLengthLimits | — | `public static bool IsWithinLengthLimits ( XYZ point )` |
| Method | IsZeroLength | — | `public bool IsZeroLength ()` |
| Method | Multiply | — | `public XYZ Multiply ( double value )` |
| Method | Negate | — | `public XYZ Negate ()` |
| Method | Normalize | — | `public XYZ Normalize ()` |
| Method | Subtract | — | `public XYZ Subtract ( XYZ source )` |
| Method | ToString | — | `public override string ToString ()` |
| Method | TripleProduct | — | `public double TripleProduct ( XYZ middle , XYZ right )` |
| Property | BasisX | — | `public static XYZ BasisX { get ; }` |
| Property | BasisY | — | `public static XYZ BasisY { get ; }` |
| Property | BasisZ | — | `public static XYZ BasisZ { get ; }` |
| Property | Item | — | `public double this [ int idx ] { get ; }` |
| Property | X | — | `public double X { get ; }` |
| Property | Y | — | `public double Y { get ; }` |
| Property | Z | — | `public double Z { get ; }` |
| Property | Zero | — | `public static XYZ Zero { get ; }` |